


const first_arguments = [
    "Ты идиот!",
    "Ты говноед!",
    "Ты малолетний дебил!",
    "Ты бомж!",
    "Ты умалишенный!",
    "Ты пельмень контуженный!",
    "Ублюдок!",
    "Ананист чертов!",
    "Мать твою,",
    "На кого шуршишь, пакетик?",
    "Гони говно по трубам!",
    "Иди шторы жри!",
    "Ты гад!",
    "Ты негодяй!",
    "Ты решил ко мне лезть?",
    "Ты паршивец!",
    "Ты тварь!",
    "Ты супостат!",
    "Ты блевотное ведрище!",
    " ",
    "Ты неудачник!",
    "Ты говножуй!",
    "Сука!",
    "Чайка бородатая!",
    "Ты не способен ничего достичь!",
    "Я тебя на вилы насажу!",
    "Ты глиномес!",
    "Иди отсюда!",
    "Торчок жеванный!",
    "Я тебя сейчас на ноль умножу!",
    "Хлебни говна!",
    "Погань!",
    "Ты существо, не способное комплексно мыслить!",
    "Чернь поганая!",
    "Ты мерзкий!",
    "Не туда ты зашел!",
    "Ты берега попутал?",
    "Да ты редкий мудак!",
    "Здравствуй, кусок говна!",
    "Ах ты лицемер!",
    "Ты жирдяй!",
    "Ты не справишься!",
    "Осуждаю твои действия!",
    "Беспомощный...",
    "Чего ты достиг?",
    "Иди жри говно с лопаты!",
    "Ты погряз в дремучем невежестве!",
    "Иди работай!",
    "Уважаемый!",
    "Жиртрест!",
    "Тебя все ненавидят!",
    "Ты говнюк!",
    "Если я еще хоть раз повторю!",
    "Если еще хоть раз повторю!",
    "У тебя жизнь - полное дерьмо!",
    "Ты ничего не хочешь!",
    "Тебе ничего не надо!",
    "Ты лентяй!",
    "Ты тупорылый!",
    "Ты балабол и дурак!",
    "Ты трепло дешевое!",
    "Лечись от говноедства!",
    "Никто тебя не уважает!",
    "Ты малолетний дебил!",
    "Ты дегенерат!",
    "Ты нарколыга!",
    "Ты ничего не сделал!",
    "Ты - разочарование!",
    "Ты ни на что не способен!",
    "Ты безумец!",
    "В твой мозг кто-то проник!",
    "Ахахаха ну ты и лох!",
    "Ой какой молодец!",
    "Иди, погрызи деревяку",
    "Что у тебя в башке творится?",
    "Невменяемый!",
    "Ты подонок!",
    "Ты сгниешь в тюрьме!",
    ""







];

const second_arguments = [
    " Тебе лечиться надо!",
    " Ты зашкварился!",
    " Да ты же феерический идиот!",
    " А ну иди сюда, говно собачье!",
    " Подстилка триперного кролика!",
    " Говно!",
    " Жопа!",
    " Анус перепуганный!",
    " Чтоб тебе по телевизору одна реклама шла!",
    " Тля обкусанная!",
    " Падла!",
    " Я тебя сам трахну!",
    " Ублюдок!",
    " Мерзавец!",
    " Идиот!",
    " Погань!",
    " Подлец!",
    " Шваль подзаборная!",
    " Алкоголик!",
    " Я тебя на скалку насажу!",
    " Я тебе покушать принес!",
    " ",
    " Сучий потрох!",
    " Хоть раз еще нажми эту кнопку!",
    " Клептоман небритый!",
    " Живи в говнище!",
    " Человечеству стыдно!",
    " Бомжара!",
    " Урод!",
    " Быдло!",
    " Гнида!",
    " Гондон!",
    " Немощный!",
    " И теперь ты - ПИДОР!",
    " Чудовище!",
    " Бездельник!",
    " Да ты тотальный кретин!",
    " Пошел ты в жопу!",
    " Иди попей говна!",
    " Ты в курсе?",
    " Тебе конец!",
    " Зверье!",
    " Гребанное животное!",
    " Вставай на колени!",
    " Давай, сходи в Макдоналдс, ублюдок!",
    " Ну ты и больной сукин сын!",
    " Бесполезное ископаемое!",
    " Ты больной?",
    " Сходи к доктору!",
    " Никому ты тут не нужен!",
    " Тебя не звали!",
    " Пошел вон отсюда!",
    " Уйди отсюда!",
    " Тебе тут не рады!",
    " Ты никому ненужный мудак!",
    " Лезь в унитаз, тебе там самое место!",
    " Ты не вылезешь из дерьма!",
    " Ты не задумывался?",
    " Ну ты и гнида!",
    " У тебя нет друзей!",
    " Все тебя призерают!",
    " Хитросплетения твоей дебильности не знают границ!",
    " Сучара!",
    " Иди хомячков дрессируй",
    " Да тебе только хомячков укрощать!",
    " Мусор вынеси, тварь!",
    " Жлоб!",
    " Да тебя расстрелять нужно!",






];


// const modal = document.getElementById("myModal");
// const btn = document.querySelector(".button-36");
// const span = document.querySelector(".close");

// btn.onclick = function () {
//     modal.style.display = "block";
// }

// span.onclick = function () {
//     modal.style.display = "none";
// }

// window.onclick = function (event) {
//     if (event.target == modal) {
//         modal.style.display = "none";
//     }
// };



function motiv() {
    let motivation = '';

    const random1st = Math.floor(Math.random() * first_arguments.length);
    const random2nd = Math.floor(Math.random() * second_arguments.length);
    motivation += first_arguments[random1st] + second_arguments[random2nd];
    document.getElementById("motivation").innerHTML = motivation;
    document.getElementById("motivation").classList.add("motivation1");
    


}


const textVoice = document.getElementById("motivation");
const speakVoice = document.getElementsByClassName("button-36");

function speakText() {
    
    
    window.speechSynthesis.cancel();

    const text = textVoice.innerHTML;
    const utterance = new SpeechSynthesisUtterance(text);
    utterance.rate = 1.0;
    utterance.pitch = 1;
    utterance.volume = 2;
    
    setTimeout(()=>{
        console.log(window.speechSynthesis.getVoices());
        const voices = window.speechSynthesis.getVoices();
        const newVoice = voices.find((v) => {
            return v.name === 'Google русский';
        });
        utterance.voice = newVoice;
        window.speechSynthesis.speak(utterance);
    }, 50);
    
    

    
}




