


const first_arguments = [
    "Ты идиот!",
    "Ты говноед!",
    "Ты малолетний дебил!",
    "Ты бомж!",
    "Ты умалишенный!",
    "Ты пельмень контуженный!",
    "Ублюдок!",
    "Ананист чертов!",
    "Мать твою,",
    "На кого шуршишь, пакетик?",
    "Гони говно по трубам!",
    "Иди шторы жри!",
    "Ты гад!",
    "Ты негодяй!",
    "Ты решил ко мне лезть?",
    "Ты паршивец!",
    "Ты тварь!",
    "Ты супостат!",
    "Ты блевотное ведрище!",
    " ",
    "Ты неудачник!",
    "Ты говножуй!",
    "Сука!",
    "Чайка бородатая!",
    "Ты не способен ничего достичь!",
    "Я тебя на вилы насажу!",
    "Ты глиномес!",
    "Иди отсюда!",
    "Торчок жеванный!",
    "Я тебя сейчас на ноль умножу!",
    "Хлебни говна!",
    "Погань!",
    "Ты существо, не способное комплексно мыслить!",
    "Чернь поганая!",
    "Ты мерзкий!",
    "Не туда ты зашел!",
    "Ты берега попутал?",
    "Да ты редкий мудак!",
    "Здравствуй, кусок говна!",
    "Ах ты лицемер!",
    "Ты жирдяй!",
    "Ты не справишься!",
    "Осуждаю твои действия!",
    "Беспомощный...",
    "Чего ты достиг?",
    "Иди жри говно с лопаты!",
    "Ты погряз в дремучем невежестве!",
    "Иди работай!",
    "Уважаемый!",
    "Жиртрест!",
    "Тебя все ненавидят!",
    "Ты говнюк!",
    "Если я еще хоть раз повторю!",
    "Если еще хоть раз повторю!",
    "У тебя жизнь - полное дерьмо!",
    "Ты ничего не хочешь!",
    "Тебе ничего не надо!",
    "Ты лентяй!",
    "Ты тупорылый!",
    "Ты балабол и дурак!",
    "Ты трепло дешевое!",
    "Лечись от говноедства!",
    "Никто тебя не уважает!",
    "Ты малолетний дебил!",
    "Ты дегенерат!",
    "Ты нарколыга!",
    "Ты ничего не сделал!",
    "Ты - разочарование!",
    "Ты ни на что не способен!",
    "Ты безумец!",
    "В твой мозг кто-то проник!",
    "Ахахаха ну ты и лох!",
    "Ой какой молодец!",
    "Иди, погрызи деревяжку",
    "Что у тебя в башке творится?",
    "Невменяемый!",
    "Ты подонок!",
    "Ты сгниешь в тюрьме!",
    "Чего ты там вопишь?",
    "Ну ты дурак.",
    "Я тебе моргалы выколю!",
    "Ты за это заплатишь!",
    "Ты пришел к успеху!",
    "У тебя неважные планы!",
    "Что с тобой?",
    "У тебя явно что-то пошло не так.",
    "Неудачная работа",
    "Отвратительно поработал!",
    "Ты нажрался?",
    "Проснись придурок!",
    "Ты живешь в кошмаре!",
    "Это просто сон.",
    "Приветствую! Ты в аду!",
    "Ты ушлепок!",
    "Ты - тупиковая ветвь эволюции!",
    "Переоденься!",
    "Отличный денек для рыбалки!",
    "Ты че творишь?",
    "У тебя шифер потек!",
    "Ты гусей погнал!",
    "Попперсов нанюхался?",
    "Ты элитный долботреп!",
    "Ты жирный, страшный и старый!",
    "Ты мой шнырь!",
    "Ты преступник!",
    "Что те от меня надо?",
    "Унылый зануда!",
    "Ты живешь в аду!",
    "Добро пожаловать в ад!",
    "Ты ощущаешь себя пидором.",
    "Ты не любишь котиков!",
    "Нюхай клей!",
    "Бухай пиво!",
    "Нюхай бензик!",
    "Ты не просто так делаешь, что делаешь.",
    "Ты злобный подоконник!",
    "Ты подлая крыса!",
    "Тебя все бросили!",
    "Ты пьешь неразбавленную краску?",
    "У тебя минимальная зарплата!",






];

const second_arguments = [
    " Тебе лечиться надо!",
    " Ты зашкварился!",
    " Да ты же феерический идиот!",
    " А ну иди сюда, говно собачье!",
    " Подстилка триперного кролика!",
    " Говно!",
    " Жопа!",
    " Анус перепуганный!",
    " Чтоб тебе по телевизору одна реклама шла!",
    " Тля обкусанная!",
    " Падла!",
    " Я тебя сам трахну!",
    " Ублюдок!",
    " Мерзавец!",
    " Идиот!",
    " Погань!",
    " Подлец!",
    " Шваль подзаборная!",
    " Алкоголик!",
    " Я тебя на скалку насажу!",
    " Я тебе покушать принес!",
    " ",
    " Сучий потрох!",
    " Хоть раз еще нажми эту кнопку!",
    " Клептоман небритый!",
    " Живи в говнище!",
    " Человечеству стыдно!",
    " Бомжара!",
    " Урод!",
    " Быдло!",
    " Гнида!",
    " Гондон!",
    " Немощный!",
    " И теперь ты - ПИДОР!",
    " Чудовище!",
    " Бездельник!",
    " Да ты тотальный кретин!",
    " Пошел ты в жопу!",
    " Иди попей говна!",
    " Ты в курсе?",
    " Тебе конец!",
    " Зверье!",
    " Гребанное животное!",
    " Вставай на колени!",
    " Давай, сходи в Макдоналдс, ублюдок!",
    " Ну ты и больной сукин сын!",
    " Бесполезное ископаемое!",
    " Ты больной?",
    " Сходи к доктору!",
    " Никому ты тут не нужен!",
    " Тебя не звали!",
    " Пошел вон отсюда!",
    " Уйди отсюда!",
    " Тебе тут не рады!",
    " Ты никому ненужный мудак!",
    " Лезь в унитаз, тебе там самое место!",
    " Ты не вылезешь из дерьма!",
    " Ты не задумывался?",
    " Ну ты и гнида!",
    " У тебя нет друзей!",
    " Все тебя призерают!",
    " Хитросплетения твоей дебильности не знают границ!",
    " Сучара!",
    " Иди хомячков дрессируй",
    " Да тебе только хомячков укрощать!",
    " Мусор вынеси, тварь!",
    " Жлоб!",
    " Да тебя расстрелять нужно!",
    " Нереальный идиот!",
    " Просто ты мудак.",
    " Гитлер!",
    " Какой ты милый",
    " Как и твой отец.",
    " Как и твоя мать.",
    " Я отучу тебя доставлять мне неприятности!",
    " Молодец!",
    " Ты конкретно воняешь!",
    " Ты обосрался!",
    " Ты обоссался!",
    " Это просто сон, гребаный кошмар!",
    " У тебя будет очень хреновый джень!",
    " Я тебя сожру!",
    " Уничтожь улики!",
    " Курить меньше надо!",
    " Ты обблеван!",
    " Совершил нечто ужасное!",
    " Тебя посадят!",
    " Ты на дне!",
    " Ты подсел?",
    " Что ты за человек такой?",
    " Ты напуган до усрачки!",
    " Тебя вот-вот пырнут ножом!",
    " Я дам тебе еще один шанс.",
    " Ты уж прости меня.",
    " Сознайся!",
    " Покайся!",
    " Перестань воровать монетки из фонтана!",
    " К успеху парень шел...",
    " Пойди проветрись!",
    " У тебя дерьмо на лице!",
    " Я накладываю личное вето!",
    " У тебя больная фантазия!",
    " От тебя несет!",














];


// const modal = document.getElementById("myModal");
// const btn = document.querySelector(".button-36");
// const span = document.querySelector(".close");

// btn.onclick = function () {
//     modal.style.display = "block";
// }

// span.onclick = function () {
//     modal.style.display = "none";
// }

// window.onclick = function (event) {
//     if (event.target == modal) {
//         modal.style.display = "none";
//     }
// };



function motiv() {
    let motivation = '';

    const random1st = Math.floor(Math.random() * first_arguments.length);
    const random2nd = Math.floor(Math.random() * second_arguments.length);
    motivation += first_arguments[random1st] + second_arguments[random2nd];
    document.getElementById("motivation").innerHTML = motivation;
    document.getElementById("motivation").classList.add("motivation1");
    document.getElementById("motivation").classList.add("motivation1-wrapper");


}


const textVoice = document.getElementById("motivation");
const speakVoice = document.getElementsByClassName("button-36");

function speakText() {
    
    
    window.speechSynthesis.cancel();

    const text = textVoice.innerHTML;
    const utterance = new SpeechSynthesisUtterance(text);
    utterance.rate = 1.0;
    utterance.pitch = 1;
    utterance.volume = 2;
    
    setTimeout(()=>{
        console.log(window.speechSynthesis.getVoices());
        const voices = window.speechSynthesis.getVoices();
        const newVoice = voices.find((v) => {
            return v.name === 'Google русский';
        });
        utterance.voice = newVoice;
        window.speechSynthesis.speak(utterance);
    }, 50);
    
    

    
}




